#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation ✅`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.postgresql-flexible-server.random_string.this: Refreshing state... [id=mAiplm1druv8kmhC]
module.postgresql-flexible-server.random_password.this: Refreshing state... [id=none]
module.key-vault.data.azuread_service_principal.this[0]: Reading...
module.key-vault.data.azuread_user.this[0]: Reading...
module.postgresql-flexible-server.data.azuread_user.this["kacper@retoxxdev.onmicrosoft.com"]: Reading...
module.postgresql-flexible-server.data.azuread_user.this["kacper@retoxxdev.onmicrosoft.com"]: Read complete after 0s [id=99d460c0-781f-46f8-9363-96fd28fd239e]
module.key-vault.data.azuread_service_principal.this[0]: Read complete after 1s [id=ea97ed8b-2467-4559-9cfb-e964e0c753ee]
module.key-vault.data.azuread_user.this[0]: Read complete after 1s [id=99d460c0-781f-46f8-9363-96fd28fd239e]
module.postgresql-flexible-server.data.azurerm_client_config.current: Reading...
module.key-vault.data.azurerm_client_config.current: Reading...
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu]
module.key-vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xNjczZjhlMy0xYWIwLTQyYjctYjgwZS0zMTdlMTQzYTdjOWY7b2JqZWN0SWQ9OTQ1ZmJlNTYtMTAzYy00NGQ0LTg2OGQtMGI0MGJmZjAwZWIwO3N1YnNjcmlwdGlvbklkPTA5YmNmOGQ0LTM1ZWEtNDZmYy05MGQxLWI1MTNkNGMwMGQ1NDt0ZW5hbnRJZD00ZDAyZDZmMS0wYTIzLTQ2ZTctOWU0Yi02N2ZlMTVjY2M5ZDI=]
module.postgresql-flexible-server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xNjczZjhlMy0xYWIwLTQyYjctYjgwZS0zMTdlMTQzYTdjOWY7b2JqZWN0SWQ9OTQ1ZmJlNTYtMTAzYy00NGQ0LTg2OGQtMGI0MGJmZjAwZWIwO3N1YnNjcmlwdGlvbklkPTA5YmNmOGQ0LTM1ZWEtNDZmYy05MGQxLWI1MTNkNGMwMGQ1NDt0ZW5hbnRJZD00ZDAyZDZmMS0wYTIzLTQ2ZTctOWU0Yi02N2ZlMTVjY2M5ZDI=]
azurerm_private_dns_zone.kv: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.key-vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu]
module.kubernetes-cluster.azurerm_user_assigned_identity.this[0]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sample-app-neu]
module.container-registry.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu]
module.virtual-network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu]
azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.dns-zone.azurerm_dns_zone.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me]
module.storage-account-logs.azurerm_storage_account.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Storage/storageAccounts/stsampleappneulogs]
module.virtual-network.azurerm_subnet.this["snet-sample-app-neu-aks"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu/subnets/snet-sample-app-neu-aks]
azurerm_private_dns_zone_virtual_network_link.kv: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/vdn-kv-sample-app-neu]
module.virtual-network.azurerm_subnet.this["snet-sample-app-neu-postgres"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu/subnets/snet-sample-app-neu-postgres]
azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com/virtualNetworkLinks/vdn-psql-sample-app-neu]
module.key-vault-secrets.azurerm_key_vault_secret.this["grafana-sso"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/grafana-sso/b0f8b237964b4524abc5171385235202]
module.key-vault-secrets.azurerm_key_vault_secret.this["rabbitmq-password-dev"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/rabbitmq-password-dev/71a9a88aa3ed4c1e81931dcba3572565]
module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-core-dev-env"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/sample-app-core-dev-env/24fc27c7c85647a19d3f3bca4bd799a7]
module.key-vault-secrets.azurerm_key_vault_secret.this["retoxx-dev-sso-ca"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/retoxx-dev-sso-ca/590a10c966f54b4cacf82be644787ba7]
module.key-vault-secrets.azurerm_key_vault_secret.this["pgadmin-pgpass"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/pgadmin-pgpass/0faae72864504267a54e43f7b3fd2cc9]
module.key-vault-secrets.azurerm_key_vault_secret.this["pgadmin-admin-password"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/pgadmin-admin-password/649f9cfacf54487a8b0c73a0a6285739]
module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-messaging-dev-env"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/sample-app-messaging-dev-env/adcb6702d5f445d38a4e0aba9c40ba60]
module.key-vault-secrets.azurerm_key_vault_secret.this["pgadmin-sso"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/pgadmin-sso/cb0f2f2a5cfe4f3a8993222c6936d28c]
module.kubernetes-cluster.azurerm_kubernetes_cluster.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerService/managedClusters/aks-sample-app-neu]
module.key-vault.azurerm_private_endpoint.this[0]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateEndpoints/pep-kv-sample-app-neu]
module.postgresql-flexible-server.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-sample-app-neu]
module.postgresql-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.this["kacper@retoxxdev.onmicrosoft.com"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-sample-app-neu/administrators/99d460c0-781f-46f8-9363-96fd28fd239e]
module.storage-account-logs.azurerm_storage_container.this["chunks"]: Refreshing state... [id=https://stsampleappneulogs.blob.core.windows.net/chunks]
module.storage-account-logs.azurerm_storage_container.this["loki"]: Refreshing state... [id=https://stsampleappneulogs.blob.core.windows.net/loki]
module.storage-account-logs.azurerm_storage_container.this["ruler"]: Refreshing state... [id=https://stsampleappneulogs.blob.core.windows.net/ruler]
module.storage-account-logs.azurerm_storage_container.this["admin"]: Refreshing state... [id=https://stsampleappneulogs.blob.core.windows.net/admin]
module.dns-zone.azurerm_dns_a_record.this["@"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me/A/@]
module.dns-zone.azurerm_dns_a_record.this["*"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me/A/*]
module.role-assignments.azurerm_role_assignment.principal_ids["Reader-ea97ed8b-2467-4559-9cfb-e964e0c753ee"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Authorization/roleAssignments/6cb08ab1-dbd7-9365-b5ea-2bcc62729735]
module.role-assignments.azurerm_role_assignment.principal_ids["Storage Blob Data Contributor-ea97ed8b-2467-4559-9cfb-e964e0c753ee"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Storage/storageAccounts/stsampleappneulogs/providers/Microsoft.Authorization/roleAssignments/00d4a0c0-c272-a3cf-50f0-555719e6396e]
module.role-assignments.azurerm_role_assignment.principal_ids["AcrPull-ea97ed8b-2467-4559-9cfb-e964e0c753ee"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/ccdc01b6-8292-5ee3-7c8e-bd41e01a2c2c]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-infra-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Read complete after 1s [id=ff75e804-3e39-4335-a603-cdd0ce98db4b]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-infra-githubactions"]: Read complete after 1s [id=04218124-c797-45d6-bc34-294fc2f87af1]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Read complete after 1s [id=50284a0a-c2e6-484f-a5c1-26c1f612a774]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Read complete after 1s [id=2fd74462-5a25-4371-b0e9-bef5a439f25e]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-client-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/9e20dc58-3be0-ae36-d35a-504d74b126ef]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-messaging-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/eb5db058-7e7b-83dd-fa1c-35fac66837cb]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-core-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/27e98e8c-45c2-d593-7b00-378c8f9611d8]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-infra-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/37e5ab73-84ff-152c-3bd1-85d31e680b3b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.key-vault-secrets.azurerm_key_vault_secret.this["rabbitmq-password-prod"] will be created
  + resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu"
      + name                    = "rabbitmq-password-prod"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-core-prod-env"] will be created
  + resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu"
      + name                    = "sample-app-core-prod-env"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-messaging-prod-env"] will be created
  + resource "azurerm_key_vault_secret" "this" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu"
      + name                    = "sample-app-messaging-prod-env"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.kubernetes-cluster.azurerm_kubernetes_cluster.this,
  on .terraform/modules/kubernetes-cluster/main.tf line 447, in resource "azurerm_kubernetes_cluster" "this":
 447:   public_network_access_enabled     = var.public_network_access_enabled

`public_network_access_enabled` is currently not functional and is not be
passed to the API
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*